$(function() {
	var availableTags = ["","(維修進行中，暫時關閉，不便之處，敬請原諒)","「一路一帶」尋寶專區","am區","Endless Choice 無盡的選擇","Gloomy Sunday","I.T.","iOS","IQ/推理題","meme","Pantry","PC 軟件下載","PSP","RealBlog","RF成人英語進修中心","RF教室","RF飛碟技巧交流中心","Webb哥點將錄","上市公司新聞","世界之大，無奇不有","主題曲","優惠專區","內部論壇","全球政治經濟社會區","冷言笑語","創業","功能性測試版","動漫綜合","動漫遊戲音樂","即市討論區","原創社","吹水","唯美區","嘈交區","嘉里物流","國際經濟","地產","外語","天籟之音：那歌聲，曾令我淚流滿面------RF金曲回憶區","好歌","娛樂廣場","小游戲","小說","建築","強國","心理測驗","思想--語言--力量--命運論壇","惡搞胡扯","愛上老北京","愛情文章","打工仔","政治民生區","文bug流暢","文章保管庫","智慧","書藉及文章分享區","期權期指輪天地","東方Project","林山木報館","格隆滙","每日呃分灌水區","波馬風雲","測試","港股專區","潮流潮物 [Fashion board]","無責任問答","狂推心水number膠！膠！膠！區","生日:3","短炒技巧、技术、心得、经验、教训分享区","短片","站務","素材","美股專區","考試","股壇維基研發區","股海挪亞方舟","股票專業討論區","英文","英文的魅力-----夢想達成論壇（一）","莊圓大師","華麗","蘋果專欄","識飲色食","財經人物","財經專業機構","財經書籍","貼圖","資源共享","遊戲下載","郊遊遠足","雨傘革命","電玩綜合","非常政經全球金融區","飲食","香港人。香港事","香港社會現象區","香港非常政經互動區","馬後砲膠區之圖表","龍鳳大茶樓"];
	$("#searchfield").autocomplete({
		source: availableTags,
		focus: function(event, ui) {
			$('#searchfield').val(ui.item.label);
			return false;
		},
		select: function(event, ui) {
			$('#searchfield').val(ui.item.label);
			document.searchform.submit();
			return false;
		}
	});
});